console.log(`1. Вёрстка страницы Main соответствует макету при ширине экрана 1280px +14\n
    2. Вёрстка страницы Main соответствует макету при ширине экрана 768px +14\n
    3. Вёрстка страницы Main соответствует макету при ширине экрана 320px +14\n
    4. Вёрстка страницы Pets соответствует макету при ширине экрана 1280px +6\n
    5. Вёрстка страницы Pets соответствует макету при ширине экрана 768px +6\n
    6. Вёрстка страницы Pets соответствует макету при ширине экрана 320px +6\n
    7. Ни на одном из разрешений до 320px включительно не появляется горизонтальная полоса прокрутки, справа от отдельных\n блоков не появляются белые поля. Весь контент страницы при этом сохраняется: не обрезается и не удаляется: +20\n
    8. Верстка резиновая: при плавном изменении размера экрана от 1280px до 320px верстка подстраивается под этот размер,\n элементы верстки меняют свои размеры и расположение, не наезжают друг на друга, изображения могут менять размер,\n но сохраняют правильные пропорции\n
    9. При ширине экрана меньше 768px на обеих страницах меню в хедере скрывается, появляется иконка бургер-меню: +4\n
    10. Верстка обеих страниц валидная +8\n
`);