console.log(`Страница Main (60):\n
    верстка страницы валидная\n
    логотип в хедере состоит из текстовых элементов\n
    страница содержит ровно один элемент 'h1'\n
    добавлен favicon\n
    вёрстка соответствует макету\n
    для позиционирования элементов блока Help использована сеточная верстка (flexbox или grid)\n
    при уменьшении масштаба страницы браузера или увеличении ширины страницы (>1280px)\n
    фоновый цвет тянется на всю ширину страницы\n
    элементы интерактивны\nСтраница Pets (40):\n
    верстка страницы валидная\n
    логотип в хедере состоит из текстовых элементов\n
    страница содержит ровно один элемент 'h1'\n
    добавлен favicon\n
    вёрстка соответствует макету\n
    при уменьшении масштаба страницы браузера или увеличении ширины страницы (>1280px)\n
    фоновый цвет тянется на всю ширину страницы\n
    элементы интерактивны\n
`);